tests/Amadeus/Client/Session/Handler/testfiles/dummyPnrRequestsoapheader2.txt

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://xml.amadeus.com/PNRRET_09_1_1A" xmlns:ns2="http://xml.amadeus.com/ws/2009/01/WBS_Session-2.0.xsd"><SOAP-ENV:Header><ns2:Session><ns2:SessionId>XFHZEKLRZHREJ</ns2:SessionId><ns2:SequenceNumber>13</ns2:SequenceNumber><ns2:SecurityToken>RKLERJEZLKRHZEJKLRHEZJKLREZRHEZK</ns2:SecurityToken></ns2:Session></SOAP-ENV:Header><SOAP-ENV:Body><ns1:PNR_Retrieve><ns1:retrievalFacts><ns1:retrieve><ns1:type>2</ns1:type></ns1:retrieve><ns1:reservationOrProfileIdentifier><ns1:reservation><ns1:controlNumber>ABC123</ns1:controlNumber></ns1:reservation></ns1:reservationOrProfileIdentifier></ns1:retrievalFacts></ns1:PNR_Retrieve></SOAP-ENV:Body></SOAP-ENV:Envelope>